       IDENTIFICATION DIVISION. 
       PROGRAM-ID. palindrome.
       DATA DIVISION. 
         WORKING-STORAGE SECTION.
         01 PAL-CHECK PIC A(6) VALUE 'AABBDA'.
         01 REV-PAL PIC A(6).
       PROCEDURE DIVISION.
           MOVE FUNCTION REVERSE(PAL-CHECK) TO REV-PAL.
           IF PAL-CHECK EQUAL REV-PAL THEN
              DISPLAY "STRING IS A PALINDROME"
           ELSE
              DISPLAY "STRING IS NOT A PALINDROME"
           END-IF.
           STOP RUN.